app/controllers/abooks_controller.rb

SELECT "abooks".* FROM "abooks"
---
  def index
    @abooks = Abook.all

INSERT INTO "abooks" ("title", "description", "sdescription", "image", "previewo", "previewt", "previewth", "price", "offerprice", "saving", "off", "coupon", "author", "publication", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @abook = Abook.new(abook_params)

    respond_to do |format|
      if @abook.save

SELECT  "abooks".* FROM "abooks" WHERE "abooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_abook
      @abook = Abook.find(params[:id])