app/controllers/cbooks_controller.rb

INSERT INTO "cbooks" ("title", "description", "sdescription", "image", "previewo", "previewt", "previewth", "price", "offerprice", "saving", "off", "coupon", "author", "publication", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @cbook = Cbook.new(cbook_params)

    respond_to do |format|
      if @cbook.save

SELECT  "cbooks".* FROM "cbooks" WHERE "cbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_cbook
      @cbook = Cbook.find(params[:id])