app/controllers/products_controller.rb

INSERT INTO "products" ("title", "category", "description", "sdescription", "image", "previewo", "previewt", "previewth", "price", "offerprice", "saving", "off", "coupon", "author", "publication", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "author" = ?, "publication" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["author", "gyg"], ["publication", "fdgf"], ["updated_at", "2018-11-06 06:32:28.011300"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)