app/controllers/requests_controller.rb

INSERT INTO "requests" ("name", "phone", "address", "bname", "author", "info", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @request = Request.new(request_params)

    respond_to do |format|
      if @request.save