app/controllers/sbooks_controller.rb

  def index
    @sbooks = Sbook.all
---
SELECT "sbooks".* FROM "sbooks"

  def create
    @sbook = Sbook.new(sbook_params)

    respond_to do |format|
      if @sbook.save
---
INSERT INTO "sbooks" ("title", "description", "sdescription", "image", "previewo", "previewt", "previewth", "price", "offerprice", "saving", "off", "coupon", "author", "publication", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_sbook
      @sbook = Sbook.find(params[:id])
---
SELECT  "sbooks".* FROM "sbooks" WHERE "sbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]