app/controllers/welcome_controller.rb

SELECT "products".* FROM "products"
---
  def academics
    @products = Product.all

SELECT "products".* FROM "products"
---
  def school
    @products = Product.all

SELECT "products".* FROM "products"
---
  def general
    @products = Product.all